<template>
  <div class="policy-info">
    <div class="header">
      <h3>使用條款</h3>
    </div>
    <div class="body">
      <div class="policy-content">
        <h4>1.即南助乞門只北看經神香免朱</h4>
        <p>
          做幫游雄。告水比音在記洋太示羊村師具您、信河追！主直元兩婆只員？游玉几記玩足條共乞喜話故，帶前澡馬直鳥胡大父的安吉步他娘晚，耳夕己玉院羊長根完七京汗抄重；帶畫米哭幾珠造，車水追完。抄笑邊還次動半反鼻，冒第語哪什！間汁綠口英哥外車小把金她訴包，雪菜斗：告至蝴色幼上爪者八、鳥會種讀個祖女弟忍右沒司果尾蝶語現大開。送結聲古胡音消主頭長蝸。
          問肖尤壯共更多因告海海聽呀的弟歡長麻頁童，話友面師師石千冰休回？誰頁來胡麻，甲連位就化抄亮跟身八早旁「刃故文誰中游車」去種雪元飛神唱。要天北几追游風清汁隻品長時收胡每害四追。反息母怪聲沒。毛裝時片；乍鳥心姊肉掃白。包采夏少手你用欠蝶耍借！旦生夕一功往你美飛拉屋男、蝸秋得北。旦間几麻候國息房說色着娘手活尤；祖哭白衣蝸。別河做吹，找出里幸麼手貫果跳得鴨水明至放比年「走」完音清裏以牛几助爪消抱只裏「吉」未英物卜彩穿行平在活說還弓。
        </p>
      </div>
      <div class="policy-content">
        <h4>2.即南助乞門只北看經神香免朱</h4>
        <p>
          做幫游雄。告水比音在記洋太示羊村師具您、信河追！主直元兩婆只員？游玉几記玩足條共乞喜話故，帶前澡馬直鳥胡大父的安吉步他娘晚，耳夕己玉院羊長根完七京汗抄重；帶畫米哭幾珠造，車水追完。抄笑邊還次動半反鼻，冒第語哪什！間汁綠口英哥外車小把金她訴包，雪菜斗：告至蝴色幼上爪者八、鳥會種讀個祖女弟忍右沒司果尾蝶語現大開。送結聲古胡音消主頭長蝸。
          問肖尤壯共更多因告海海聽呀的弟歡長麻頁童，話友面師師石千冰休回？誰頁來胡麻，甲連位就化抄亮跟身八早旁「刃故文誰中游車」去種雪元飛神唱。要天北几追游風清汁隻品長時收胡每害四追。反息母怪聲沒。毛裝時片；乍鳥心姊肉掃白。包采夏少手你用欠蝶耍借！旦生夕一功往你美飛拉屋男、蝸秋得北。旦間几麻候國息房說色着娘手活尤；祖哭白衣蝸。別河做吹，找出里幸麼手貫果跳得鴨水明至放比年「走」完音清裏以牛几助爪消抱只裏「吉」未英物卜彩穿行平在活說還弓。
        </p>
      </div>
      <div class="policy-content">
        <h4>3.即南助乞門只北看經神香免朱</h4>
        <p>
          做幫游雄。告水比音在記洋太示羊村師具您、信河追！主直元兩婆只員？游玉几記玩足條共乞喜話故，帶前澡馬直鳥胡大父的安吉步他娘晚，耳夕己玉院羊長根完七京汗抄重；帶畫米哭幾珠造，車水追完。抄笑邊還次動半反鼻，冒第語哪什！間汁綠口英哥外車小把金她訴包，雪菜斗：告至蝴色幼上爪者八、鳥會種讀個祖女弟忍右沒司果尾蝶語現大開。送結聲古胡音消主頭長蝸。
          問肖尤壯共更多因告海海聽呀的弟歡長麻頁童，話友面師師石千冰休回？誰頁來胡麻，甲連位就化抄亮跟身八早旁「刃故文誰中游車」去種雪元飛神唱。要天北几追游風清汁隻品長時收胡每害四追。反息母怪聲沒。毛裝時片；乍鳥心姊肉掃白。包采夏少手你用欠蝶耍借！旦生夕一功往你美飛拉屋男、蝸秋得北。旦間几麻候國息房說色着娘手活尤；祖哭白衣蝸。別河做吹，找出里幸麼手貫果跳得鴨水明至放比年「走」完音清裏以牛几助爪消抱只裏「吉」未英物卜彩穿行平在活說還弓。
        </p>
      </div>
      <div class="policy-content">
        <h4>4.即南助乞門只北看經神香免朱</h4>
        <p>
          做幫游雄。告水比音在記洋太示羊村師具您、信河追！主直元兩婆只員？游玉几記玩足條共乞喜話故，帶前澡馬直鳥胡大父的安吉步他娘晚，耳夕己玉院羊長根完七京汗抄重；帶畫米哭幾珠造，車水追完。抄笑邊還次動半反鼻，冒第語哪什！間汁綠口英哥外車小把金她訴包，雪菜斗：告至蝴色幼上爪者八、鳥會種讀個祖女弟忍右沒司果尾蝶語現大開。送結聲古胡音消主頭長蝸。
          問肖尤壯共更多因告海海聽呀的弟歡長麻頁童，話友面師師石千冰休回？誰頁來胡麻，甲連位就化抄亮跟身八早旁「刃故文誰中游車」去種雪元飛神唱。要天北几追游風清汁隻品長時收胡每害四追。反息母怪聲沒。毛裝時片；乍鳥心姊肉掃白。包采夏少手你用欠蝶耍借！旦生夕一功往你美飛拉屋男、蝸秋得北。旦間几麻候國息房說色着娘手活尤；祖哭白衣蝸。別河做吹，找出里幸麼手貫果跳得鴨水明至放比年「走」完音清裏以牛几助爪消抱只裏「吉」未英物卜彩穿行平在活說還弓。
        </p>
      </div>
      <div class="policy-content">
        <h4>5.即南助乞門只北看經神香免朱</h4>
        <p>
          做幫游雄。告水比音在記洋太示羊村師具您、信河追！主直元兩婆只員？游玉几記玩足條共乞喜話故，帶前澡馬直鳥胡大父的安吉步他娘晚，耳夕己玉院羊長根完七京汗抄重；帶畫米哭幾珠造，車水追完。抄笑邊還次動半反鼻，冒第語哪什！間汁綠口英哥外車小把金她訴包，雪菜斗：告至蝴色幼上爪者八、鳥會種讀個祖女弟忍右沒司果尾蝶語現大開。送結聲古胡音消主頭長蝸。
          問肖尤壯共更多因告海海聽呀的弟歡長麻頁童，話友面師師石千冰休回？誰頁來胡麻，甲連位就化抄亮跟身八早旁「刃故文誰中游車」去種雪元飛神唱。要天北几追游風清汁隻品長時收胡每害四追。反息母怪聲沒。毛裝時片；乍鳥心姊肉掃白。包采夏少手你用欠蝶耍借！旦生夕一功往你美飛拉屋男、蝸秋得北。旦間几麻候國息房說色着娘手活尤；祖哭白衣蝸。別河做吹，找出里幸麼手貫果跳得鴨水明至放比年「走」完音清裏以牛几助爪消抱只裏「吉」未英物卜彩穿行平在活說還弓。
        </p>
      </div>
    </div>
  </div>
</template>

.<style scoped>
.policy-info {
  background: #ffffff;
  border-radius: 16px;
  box-shadow: 0px 2px 4px rgba(0, 0, 0, 0.06);
}

.policy-info .header {
  border-radius: 16px 16px 0 0;
  border-bottom: 0.5px solid #e0e0e0;
  box-shadow: none;
}

.policy-info .header h3 {
  font-weight: 500;
  font-size: 32px;
  line-height: 40px;
  color: #4e68b2;
  padding: 1rem 1.5rem;
}

.policy-info .body {
  box-shadow: none;
  /* margin-top: 1rem; */
  padding: 1rem 1.5rem;
}

.policy-info .body .policy-content {
  margin-bottom: 1.5rem;
}

.policy-info .body .policy-content h4 {
  font-weight: 500;
  font-size: 20px;
  line-height: 120%;
  color: #393939;
  margin-bottom: 1rem;
}

.policy-info .body .policy-content p {
  font-size: 14px;
  line-height: 20px;
  letter-spacing: 0.1px;
  color: #525252;
}
</style>