<template>
  <section class="q-and-a">
    <Banner />
    <base-content-container>
      <p>常見問題</p>
      <el-collapse
        v-for="question in questions"
        :key="question.id"
        v-model="activeName"
        accordion
      >
        <el-collapse-item :title="question.title" :name="question.name">
          <p>{{ question.text }}</p>
        </el-collapse-item>
      </el-collapse>
    </base-content-container>
  </section>
</template>

<script>
import Banner from "../components/q-and-a/Banner.vue";

export default {
  components: {
    Banner,
  },
  data() {
    return {
      activeName: "1",
      questions: [
        {
          id: 1,
          title: "你發位王珠借立乍村文遠前把石象？",
          name: "1",
          text: "吃申三旦力未歡們了同半干：十跳而菜用。到戶走封親羊英真亭現明葉飽壯童西戶友黃旁，頁己勿成新穴花春兄示鳥至四京枝昔口人士可，吧弓小高頭三水安躲食重眼元占事；寸拍日字洋也祖肉福東坡：今父小。木洋習雨來尾汁布三牛金衣四道南入嗎我「以來它五」貝蝶綠哥平叫。由南細斗父條免海片記怎冬只！又會今蛋壯那波青高止像？同太刃雞菜乾原原石字牙貓叫！吉米爸家間小高冒北几百片小。空品進瓜姐生女刃兄化進玉點人，日老流交事肖少封菜飛細奶貝你朱到穴它片；們言嗎金刀麻員樹種游祖；寸歌水還士光乙時隻自犬？神進山樹休說；記七借松校念申喜候勿母香浪童爪「經做石課」辛火肉笑馬。",
        },
        {
          id: 2,
          title: "你發位王珠借立乍村文遠前把石象？",
          name: "2",
          text: "吃申三旦力未歡們了同半干：十跳而菜用。到戶走封親羊英真亭現明葉飽壯童西戶友黃旁，頁己勿成新穴花春兄示鳥至四京枝昔口人士可，吧弓小高頭三水安躲食重眼元占事；寸拍日字洋也祖肉福東坡：今父小。木洋習雨來尾汁布三牛金衣四道南入嗎我「以來它五」貝蝶綠哥平叫。由南細斗父條免海片記怎冬只！又會今蛋壯那波青高止像？同太刃雞菜乾原原石字牙貓叫！吉米爸家間小高冒北几百片小。空品進瓜姐生女刃兄化進玉點人，日老流交事肖少封菜飛細奶貝你朱到穴它片；們言嗎金刀麻員樹種游祖；寸歌水還士光乙時隻自犬？神進山樹休說；記七借松校念申喜候勿母香浪童爪「經做石課」辛火肉笑馬。",
        },
        {
          id: 3,
          title: "你發位王珠借立乍村文遠前把石象？",
          name: "3",
          text: "吃申三旦力未歡們了同半干：十跳而菜用。到戶走封親羊英真亭現明葉飽壯童西戶友黃旁，頁己勿成新穴花春兄示鳥至四京枝昔口人士可，吧弓小高頭三水安躲食重眼元占事；寸拍日字洋也祖肉福東坡：今父小。木洋習雨來尾汁布三牛金衣四道南入嗎我「以來它五」貝蝶綠哥平叫。由南細斗父條免海片記怎冬只！又會今蛋壯那波青高止像？同太刃雞菜乾原原石字牙貓叫！吉米爸家間小高冒北几百片小。空品進瓜姐生女刃兄化進玉點人，日老流交事肖少封菜飛細奶貝你朱到穴它片；們言嗎金刀麻員樹種游祖；寸歌水還士光乙時隻自犬？神進山樹休說；記七借松校念申喜候勿母香浪童爪「經做石課」辛火肉笑馬。",
        },
        {
          id: 4,
          title: "你發位王珠借立乍村文遠前把石象？",
          name: "4",
          text: "吃申三旦力未歡們了同半干：十跳而菜用。到戶走封親羊英真亭現明葉飽壯童西戶友黃旁，頁己勿成新穴花春兄示鳥至四京枝昔口人士可，吧弓小高頭三水安躲食重眼元占事；寸拍日字洋也祖肉福東坡：今父小。木洋習雨來尾汁布三牛金衣四道南入嗎我「以來它五」貝蝶綠哥平叫。由南細斗父條免海片記怎冬只！又會今蛋壯那波青高止像？同太刃雞菜乾原原石字牙貓叫！吉米爸家間小高冒北几百片小。空品進瓜姐生女刃兄化進玉點人，日老流交事肖少封菜飛細奶貝你朱到穴它片；們言嗎金刀麻員樹種游祖；寸歌水還士光乙時隻自犬？神進山樹休說；記七借松校念申喜候勿母香浪童爪「經做石課」辛火肉笑馬。",
        },
        {
          id: 5,
          title: "你發位王珠借立乍村文遠前把石象？",
          name: "5",
          text: "吃申三旦力未歡們了同半干：十跳而菜用。到戶走封親羊英真亭現明葉飽壯童西戶友黃旁，頁己勿成新穴花春兄示鳥至四京枝昔口人士可，吧弓小高頭三水安躲食重眼元占事；寸拍日字洋也祖肉福東坡：今父小。木洋習雨來尾汁布三牛金衣四道南入嗎我「以來它五」貝蝶綠哥平叫。由南細斗父條免海片記怎冬只！又會今蛋壯那波青高止像？同太刃雞菜乾原原石字牙貓叫！吉米爸家間小高冒北几百片小。空品進瓜姐生女刃兄化進玉點人，日老流交事肖少封菜飛細奶貝你朱到穴它片；們言嗎金刀麻員樹種游祖；寸歌水還士光乙時隻自犬？神進山樹休說；記七借松校念申喜候勿母香浪童爪「經做石課」辛火肉笑馬。",
        },
        {
          id: 6,
          title: "你發位王珠借立乍村文遠前把石象？",
          name: "6",
          text: "吃申三旦力未歡們了同半干：十跳而菜用。到戶走封親羊英真亭現明葉飽壯童西戶友黃旁，頁己勿成新穴花春兄示鳥至四京枝昔口人士可，吧弓小高頭三水安躲食重眼元占事；寸拍日字洋也祖肉福東坡：今父小。木洋習雨來尾汁布三牛金衣四道南入嗎我「以來它五」貝蝶綠哥平叫。由南細斗父條免海片記怎冬只！又會今蛋壯那波青高止像？同太刃雞菜乾原原石字牙貓叫！吉米爸家間小高冒北几百片小。空品進瓜姐生女刃兄化進玉點人，日老流交事肖少封菜飛細奶貝你朱到穴它片；們言嗎金刀麻員樹種游祖；寸歌水還士光乙時隻自犬？神進山樹休說；記七借松校念申喜候勿母香浪童爪「經做石課」辛火肉笑馬。",
        },
        {
          id: 7,
          title: "你發位王珠借立乍村文遠前把石象？",
          name: "7",
          text: "吃申三旦力未歡們了同半干：十跳而菜用。到戶走封親羊英真亭現明葉飽壯童西戶友黃旁，頁己勿成新穴花春兄示鳥至四京枝昔口人士可，吧弓小高頭三水安躲食重眼元占事；寸拍日字洋也祖肉福東坡：今父小。木洋習雨來尾汁布三牛金衣四道南入嗎我「以來它五」貝蝶綠哥平叫。由南細斗父條免海片記怎冬只！又會今蛋壯那波青高止像？同太刃雞菜乾原原石字牙貓叫！吉米爸家間小高冒北几百片小。空品進瓜姐生女刃兄化進玉點人，日老流交事肖少封菜飛細奶貝你朱到穴它片；們言嗎金刀麻員樹種游祖；寸歌水還士光乙時隻自犬？神進山樹休說；記七借松校念申喜候勿母香浪童爪「經做石課」辛火肉笑馬。",
        },
        {
          id: 8,
          title: "你發位王珠借立乍村文遠前把石象？",
          name: "8",
          text: "吃申三旦力未歡們了同半干：十跳而菜用。到戶走封親羊英真亭現明葉飽壯童西戶友黃旁，頁己勿成新穴花春兄示鳥至四京枝昔口人士可，吧弓小高頭三水安躲食重眼元占事；寸拍日字洋也祖肉福東坡：今父小。木洋習雨來尾汁布三牛金衣四道南入嗎我「以來它五」貝蝶綠哥平叫。由南細斗父條免海片記怎冬只！又會今蛋壯那波青高止像？同太刃雞菜乾原原石字牙貓叫！吉米爸家間小高冒北几百片小。空品進瓜姐生女刃兄化進玉點人，日老流交事肖少封菜飛細奶貝你朱到穴它片；們言嗎金刀麻員樹種游祖；寸歌水還士光乙時隻自犬？神進山樹休說；記七借松校念申喜候勿母香浪童爪「經做石課」辛火肉笑馬。",
        },
        {
          id: 9,
          title: "你發位王珠借立乍村文遠前把石象？",
          name: "9",
          text: "吃申三旦力未歡們了同半干：十跳而菜用。到戶走封親羊英真亭現明葉飽壯童西戶友黃旁，頁己勿成新穴花春兄示鳥至四京枝昔口人士可，吧弓小高頭三水安躲食重眼元占事；寸拍日字洋也祖肉福東坡：今父小。木洋習雨來尾汁布三牛金衣四道南入嗎我「以來它五」貝蝶綠哥平叫。由南細斗父條免海片記怎冬只！又會今蛋壯那波青高止像？同太刃雞菜乾原原石字牙貓叫！吉米爸家間小高冒北几百片小。空品進瓜姐生女刃兄化進玉點人，日老流交事肖少封菜飛細奶貝你朱到穴它片；們言嗎金刀麻員樹種游祖；寸歌水還士光乙時隻自犬？神進山樹休說；記七借松校念申喜候勿母香浪童爪「經做石課」辛火肉笑馬。",
        },
        {
          id: 10,
          title: "你發位王珠借立乍村文遠前把石象？",
          name: "10",
          text: "吃申三旦力未歡們了同半干：十跳而菜用。到戶走封親羊英真亭現明葉飽壯童西戶友黃旁，頁己勿成新穴花春兄示鳥至四京枝昔口人士可，吧弓小高頭三水安躲食重眼元占事；寸拍日字洋也祖肉福東坡：今父小。木洋習雨來尾汁布三牛金衣四道南入嗎我「以來它五」貝蝶綠哥平叫。由南細斗父條免海片記怎冬只！又會今蛋壯那波青高止像？同太刃雞菜乾原原石字牙貓叫！吉米爸家間小高冒北几百片小。空品進瓜姐生女刃兄化進玉點人，日老流交事肖少封菜飛細奶貝你朱到穴它片；們言嗎金刀麻員樹種游祖；寸歌水還士光乙時隻自犬？神進山樹休說；記七借松校念申喜候勿母香浪童爪「經做石課」辛火肉笑馬。",
        },
      ],
    };
  },
};
</script>

<style>
.q-and-a p {
  font-weight: 500;
  font-size: 32px;
  line-height: 40px;
  text-align: center;
  color: #4e68b2;
  margin-top: 2.5rem;
}

.q-and-a .el-collapse {
  margin: 1rem 0;
  border-radius: 16px;
}

.q-and-a .el-collapse .el-collapse-item {
  box-shadow: 0px 2px 4px rgba(0, 0, 0, 0.06);
  border-radius: 16px;
}

.q-and-a .el-collapse .el-collapse-item__header {
  background: #ffffff;
  border-radius: 16px;
  transition: all 0.5s ease;
  padding: 2rem;
  font-family: Noto Sans HK;
  font-style: normal;
  font-weight: 500;
  font-size: 20px;
  line-height: 120%;
}

.q-and-a .el-collapse .el-collapse-item__header.is-active {
  border-radius: 16px 16px 0 0;
  position: relative;
}

.q-and-a .el-collapse .el-collapse-item__header.is-active::after {
  content: "";
  position: absolute;
  background-color: #e0e0e0;
  width: calc(100% - 4rem);
  height: 1px;
  left: 2rem;
  bottom: 0;
}

.q-and-a .el-collapse .el-collapse-item__wrap {
  border-radius: 0 0 16px 16px;
}

.q-and-a .el-collapse .el-collapse-item__content {
  padding: 1rem 2rem;
  border-radius: 0 0 16px 16px;
}

.q-and-a .el-collapse .el-collapse-item__content p {
  font-family: Noto Sans HK;
  font-style: normal;
  font-weight: normal;
  font-size: 14px;
  line-height: 20px;
  letter-spacing: 0.1px;
  color: #525252;
  margin: 0;
  text-align: justify;
}
</style>